app/controllers/profile_controller.rb

  def update
    @user = current_user
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "image" = ?, "introduction" = ? WHERE "users"."id" = ?  [["updated_at", "2023-04-07 11:27:48.336402"], ["image", "スクリーンショット_2023-03-21_11.11.17.png"], ["introduction", "美味しいお酒が大好きです！！"], ["id", 4]]