app/controllers/reservations_controller.rb

INSERT INTO "reservations" ("check_in", "check_out", "number_of_people", "number_of_days", "total_price", "created_at", "updated_at", "user_id", "room_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @reservation = Reservation.new(reservation_params)
    if @reservation.save