app/controllers/rooms_controller.rb

  def create
    @room = Room.new(room_params)
    if @room.save
---
INSERT INTO "rooms" ("name", "detail", "address", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["detail", ""], ["address", ""], ["created_at", "2023-04-15 06:55:29.520607"], ["updated_at", "2023-04-15 06:55:29.520607"], ["user_id", 4]]