app/controllers/searches_controller.rb

SELECT "rooms".* FROM "rooms" ORDER BY "rooms"."updated_at" DESC
---
  def result
    @user = current_user
    @q = Room.ransack(params[:q])
    @rooms = @q.result.order(updated_at: :desc)